runWaterCooler/1/solid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   01;

vertices
(
    (-2 -1 0)    //4--
    (-2 1 0)    //5--
    (-2 1 0.1)   //6--
    (-2 -1 0.1)     //7--
    (5 -1 0)
    (5 1 0)
    (5 01 0.1)
    (5 -1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7 0 1 2 3 ) (10 1 280) simpleGrading (1 1 1)
);

boundary
(
    out
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (1 2 6 5)
        );
    }
    interfaceOut
    {
        type mappedPatch;

        // What to sample:
        sampleMode      nearestPatchFace;

        // Simulation world to sample
        sampleWorld     fluid;

        // Region to sample
        sampleRegion    region0;

        // If sampleMode is nearestPatchFace : patch to find faces of
        samplePatch     interfaceIn;

        // Use database to get data from (one-way or loose coupling in
        // combination with functionObject)
        sampleDatabase    true;

        faces
        (
            (0 1 2 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
);


// ************************************************************************* //
